// local class - 스태틱 멤버에 선언된 로컬 클래스
package com.eomcs.oop.ex11.a;

public class Exam0330 {
  public static void main(final String[] args) {
    // 스태틱 멤버는 인스턴스 없이 사용할 수 있다
    // sm을 호출할 때 exam0330의 객체 없이 호출하면
    // sm 안에서 exam0330을 사용할 수 없다
    // 그래서 스태틱 메서드 안에 있는 로컬 클래스에서는
    // 바깥 클래스의 객체를 사용할 수 없다
    Exam0330.sm();
  }

  // 스태틱 메서드의 로컬 클래스 사용법
  static void sm() {
    class A {
      // 스태틱 메서드에서는 바깥 클래스의 인스턴스 주소를 알 수 없기 때문에
      // 스태틱 메서드 안에 로컬 클래스를 정의하는 경우
      // 컴파일러는 바깥 클래스의 인스턴스 주소를 저장할 필드를 만들지 않는다
      // 또한 바깥 클래스의 인스턴스 주소를 바든 생성자를 만들지 않는다
      // => Exam0330$1A.class 확인
      void m1() {
        // 로컬 클래스가 스태틱 멤버에 정의된 경우
        // 인스턴스 주소를 모르기 때문에
        // 바깥 클래스의 인스턴스 멤버를 사용할 수 없다.
        // = > 즉, 바깥 클래스의 인스턴스를 주소를 담을 필드를 만들지 않았다
        // Exam0330.this.iValue = 100; // 컴파일 오류
      }
    }
    final A obj = new A();
    obj.m1();
  }

  int iValue;
}
